{"query": "What is the flying trapeze?", "context": "Circus aerial acts involve performers executing acrobatic movements high above the ground using specialized equipment.", "ground_truth": "An aerial circus act performed on a short horizontal bar suspended by ropes"}
{"query": "Who is considered the father of the modern circus?", "context": "The modern circus as we know it today was established in the late 18th century by an English horseman.", "ground_truth": "Philip Astley"}
{"query": "What is a ringmaster?", "context": "Circus performances require someone to introduce acts and maintain the flow of the show.", "ground_truth": "The master of ceremonies who introduces circus acts"}
{"query": "What are the three rings in a circus?", "context": "Traditional American circuses often feature multiple performance areas to showcase acts simultaneously.", "ground_truth": "Three circular stages where different acts perform at the same time"}
{"query": "What is a clown car?", "context": "Clowns often perform comedy routines that defy expectations and logic for entertainment.", "ground_truth": "A small car from which an impossibly large number of clowns emerge"}
{"query": "What is tightrope walking called?", "context": "Balance acts on elevated cables have been a staple of circus entertainment for centuries.", "ground_truth": "Tightrope walking or funambulism"}
{"query": "What is Cirque du Soleil?", "context": "Contemporary circus has evolved to include theatrical elements, music, and artistic storytelling without traditional animal acts.", "ground_truth": "A Canadian entertainment company known for contemporary circus performances"}
{"query": "What are juggling clubs?", "context": "Jugglers use various objects to demonstrate skill, coordination, and timing in their performances.", "ground_truth": "Weighted props shaped like bowling pins used in juggling"}
{"query": "What is a circus tent traditionally called?", "context": "Traveling circuses historically performed under large portable canvas structures.", "ground_truth": "The Big Top"}
{"query": "What is fire eating?", "context": "Sideshow performers demonstrate seemingly dangerous acts that require special techniques and safety measures.", "ground_truth": "A performance art involving placing flaming objects in the mouth"}
