{"query": "What is version control?", "context": "Software development teams need ways to track changes to code and collaborate effectively on projects.", "ground_truth": "A system that tracks changes to files over time"}
{"query": "What does API stand for?", "context": "Modern software applications often need to communicate with other systems and services to exchange data.", "ground_truth": "Application Programming Interface"}
{"query": "What is the difference between compiled and interpreted languages?", "context": "Programming languages can be executed in different ways, affecting performance and portability.", "ground_truth": "Compiled languages are translated to machine code before execution, interpreted languages are executed line by line"}
{"query": "What is continuous integration?", "context": "DevOps practices help teams automate testing and deployment to deliver software more reliably.", "ground_truth": "Automatically building and testing code changes frequently"}
{"query": "What is a REST API?", "context": "Web services use standardized architectural patterns to enable communication between different applications.", "ground_truth": "An API that follows REpresentational State Transfer principles"}
{"query": "What is the purpose of unit testing?", "context": "Software quality assurance requires testing at multiple levels to catch bugs early in development.", "ground_truth": "Testing individual components or functions in isolation"}
{"query": "What is agile methodology?", "context": "Software development methodologies provide frameworks for organizing work and delivering value iteratively.", "ground_truth": "An iterative approach to software development emphasizing flexibility and collaboration"}
{"query": "What is a database index?", "context": "Database performance optimization involves structures that speed up data retrieval operations.", "ground_truth": "A data structure that improves the speed of data retrieval"}
{"query": "What is Docker?", "context": "Containerization technologies help developers package applications with their dependencies for consistent deployment.", "ground_truth": "A platform for developing and running applications in containers"}
{"query": "What is the Big O notation used for?", "context": "Algorithm efficiency analysis helps developers understand performance characteristics of their code.", "ground_truth": "Describing the time or space complexity of algorithms"}
