{"query": "What is the capital of France?", "context": "France is a country in Western Europe. It is known for its rich history, culture, and landmarks.", "response": "Paris is the capital of France.", "ground_truth": "Paris"}
{"query": "What is the largest planet in our solar system?", "context": "The solar system consists of eight planets orbiting the Sun. Jupiter is a gas giant located fifth from the Sun.", "response": "Jupiter is the largest planet in our solar system.", "ground_truth": "Jupiter"}
{"query": "Who wrote the novel '1984'?", "context": "George Orwell was a British author known for his dystopian fiction. He wrote several influential novels in the 20th century.", "response": "George Orwell wrote the novel '1984'.", "ground_truth": "George Orwell"}
{"query": "What is the chemical symbol for gold?", "context": "Gold is a precious metal that has been valued throughout history. It is used in jewelry, electronics, and as a store of value.", "response": "The chemical symbol for gold is Au.", "ground_truth": "Au"}
{"query": "When was the Declaration of Independence signed?", "context": "The Declaration of Independence was a historic document that declared the thirteen American colonies' independence from British rule.", "response": "The Declaration of Independence was signed on July 4, 1776.", "ground_truth": "July 4, 1776"}
{"query": "What is the speed of light?", "context": "Light is electromagnetic radiation that travels at a constant speed in a vacuum. This speed is a fundamental physical constant.", "response": "The speed of light is approximately 299,792,458 meters per second.", "ground_truth": "299,792,458 meters per second"}
{"query": "Who painted the Mona Lisa?", "context": "The Mona Lisa is one of the most famous paintings in the world, housed in the Louvre Museum in Paris. It was created during the Renaissance period.", "response": "Leonardo da Vinci painted the Mona Lisa.", "ground_truth": "Leonardo da Vinci"}
{"query": "What is the smallest unit of matter?", "context": "Matter is composed of tiny building blocks that cannot be divided further by chemical means. These fundamental particles make up all elements.", "response": "The atom is the smallest unit of matter.", "ground_truth": "Atom"}
{"query": "Which ocean is the largest?", "context": "Earth's surface is covered by several large bodies of water called oceans. These oceans vary significantly in size and depth.", "response": "The Pacific Ocean is the largest ocean on Earth.", "ground_truth": "Pacific Ocean"}
{"query": "What is the boiling point of water at sea level?", "context": "Water changes from liquid to gas when heated to its boiling point. This temperature can vary based on atmospheric pressure and altitude.", "response": "Water boils at 100 degrees Celsius (212 degrees Fahrenheit) at sea level.", "ground_truth": "100°C or 212°F"}